---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.JointGenderMismatch
source: html/9cebbcd9-939c-1ffb-6d52-ab7614dbccbd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.JointGenderMismatch Property

The element has a connector with a fitting joint gender mismatch

## Syntax (C#)
```csharp
public static FailureDefinitionId JointGenderMismatch { get; }
```